---
kind: type
id: T:Autodesk.Revit.DB.MaterialAspect
source: html/ebeddc80-db8e-09d8-7140-a057d989b6e1.htm
---
# Autodesk.Revit.DB.MaterialAspect

A list of all material aspects that a material can store PropertySetElements for.

## Syntax (C#)
```csharp
public enum MaterialAspect
```